Revit 2027 API
FamilySizeTable.NumberOfColumns Property
 Number of columns in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfColumns { get; }
Public ReadOnly Property NumberOfColumns As Integer
	Get
public:
property int NumberOfColumns {
	int get ();
}
member NumberOfColumns : int with get
Property Value
Int32
See Also
Reference
FamilySizeTable Class
Autodesk.Revit.DB Namespace